{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Exploring drugbank data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "from lxml import etree"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<drug xmlns=\"http://www.drugbank.ca\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" type=\"biotech\" created=\"2005-06-13\" updated=\"2026-02-02\">\n",
      "  <drugbank-id primary=\"true\">DB00001</drugbank-id>\n",
      "  <drugbank-id>BTD00024</drugbank-id>\n",
      "  <drugbank-id>BIOD00024</drugbank-id>\n",
      "  <name>Lepirudin</name>\n",
      "  <description>Lepirudin is a recombinant hirudin formed by 65 amino acids that acts as a highly specific and direct thrombin inhibitor.[L41539,L41569] Natural hirudin is an endogenous anticoagulant found in _Hirudo medicinalis_ leeches.[L41539] Lepirudin is produced in yeast cells and is identical to natural hirudin except for the absence of sulfate on the tyrosine residue at position 63 and the substitution of leucine for isoleucine at position 1 (N-terminal end).[A246609]&#13;\n",
      "&#13;\n",
      "Lepirudin is used as an anticoagulant in patients with heparin-induced thrombocytopenia (HIT), an immune reaction associated with a high risk of thromboembolic complications.[A3, L41539] HIT is caused by the expression of immunoglobulin G (IgG) antibodies that bind to the complex formed by heparin and platelet factor 4. This activates endothelial cells and platelets and enhances the formation of thrombi.[A246609] Bayer ceased the production of lepirudin (Refludan) effective May 31, 2012.[L41574]</description>\n",
      "  <cas-number>138068-37-8</cas-number>\n",
      "  <unii>Y43GF64R34</unii>\n",
      "  <state>solid</state>\n",
      "  <groups>\n",
      "    <group>approved</group>\n",
      "    <group>withdrawn</group>\n",
      "  </groups>\n",
      "  <general-references>\n",
      "    <articles>\n",
      "      <article>\n",
      "        <ref-id>A1</ref-id>\n",
      "        <pubmed-id>16244762</pubmed-id>\n",
      "        <citation>Smythe MA, Stephens JL, Koerber JM, Mattson JC: A comparison of lepirudin and argatroban outcomes. Clin Appl Thromb Hemost. 2005 Oct;11(4):371-4.</citation>\n",
      "      </article>\n",
      "      <article>\n",
      "        <ref-id>A2</ref-id>\n",
      "        <pubmed-id>16690967</pubmed-id>\n",
      "        <citation>Tardy B, Lecompte T, Boelhen F, Tardy-Poncet B, Elalamy I, Morange P, Gruel Y, Wolf M, Francois D, Racadot E, Camarasa P, Blouch MT, Nguyen F, Doubine S, Dutrillaux F, Alhenc-Gelas M, Martin-Toutain I, Bauters A, Ffrench P, de Maistre E, Grunebaum L, Mouton C, Huisse MG, Gouault-Heilmann M, Lucke V: Predictive factors for thrombosis and major bleeding in an observational study in 181 patients with heparin-induced thrombocytopenia treated with lepirudin. Blood. 2006 Sep 1;108(5):1492-6. Epub 2006 May 11.</citation>\n",
      "      </article>\n",
      "      <article>\n",
      "        <ref-id>A3</ref-id>\n",
      "        <pubmed-id>16241940</pubmed-id>\n",
      "        <citation>Lubenow N, Eichler P, Lietz T, Greinacher A: Lepirudin in patients with heparin-induced thrombocytopenia - results of the third prospective study (HAT-3) and a combined analysis of HAT-1, HAT-2, and HAT-3. J Thromb Haemost. 2005 Nov;3(11):2428-36.</citation>\n",
      "      </article>\n",
      "      <article>\n",
      "        <ref-id>A246609</ref-id>\n",
      "        <pubmed-id>19707378</pubmed-id>\n",
      "        <citation>Petros S: Lepirudin in the management of patients with heparin-induced thrombocytopenia. Biologics. 2008 Sep;2(3):481-90. doi: 10.2147/btt.s3415.</citation>\n",
      "      </article>\n",
      "      <article>\n",
      "        <ref-id>A246624</ref-id>\n",
      "        <pubmed-id>25294122</pubmed-id>\n",
      "        <citation>Chapin JC, Hajjar KA: Fibrinolysis and the control of blood coagulation. Blood Rev. 2015 Jan;29(1):17-24. doi: 10.1016/j.blre.2014.09.003. Epub 2014 Sep 16.</citation>\n",
      "      </article>\n",
      "    </articles>\n",
      "    <textbooks/>\n",
      "    <links>\n",
      "      <link>\n",
      "        <ref-id>L48</ref-id>\n",
      "        <title>Google books</title>\n",
      "        <url>http://books.google.com/books?id=iadLoXoQkWEC&amp;pg=PA440</url>\n",
      "      </link>\n",
      "      <link>\n",
      "        <ref-id>L41539</ref-id>\n",
      "        <title>Health Canada Approved Drug Products: Refludan (lepirudin) lyophilized powder for intravenous injection</title>\n",
      "        <url>https://pdf.hres.ca/dpd_pm/00004023.PDF</url>\n",
      "      </link>\n",
      "      <link>\n",
      "        <ref-id>L41544</ref-id>\n",
      "        <title>FDA Clinical Pharmacology and Biopharmaceutics Review: Refludan (lepirudin) lyophilized powder for \n"
     ]
    }
   ],
   "source": [
    "# One complete drug structure in original XML format\n",
    "ctx = etree.iterparse('drugbank_data.xml', events=('end',))\n",
    "for _, el in ctx:\n",
    "    if el.tag.endswith('}drug') and el.get('type'):\n",
    "        print(etree.tostring(el, pretty_print=True).decode()[:4000])\n",
    "        break"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "NS = 'http://www.drugbank.ca'\n",
    "TAG = lambda t: f'{{{NS}}}{t}'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "tag_drug        = TAG('drug')\n",
    "tag_drugbank    = TAG('drugbank')\n",
    "tag_interaction = TAG('drug-interaction')\n",
    "tag_target      = TAG('target')\n",
    "tag_targets     = TAG('targets')\n",
    "tag_pathway     = TAG('pathway')\n",
    "tag_pathways    = TAG('pathways')\n",
    "tag_enzyme      = TAG('enzyme')\n",
    "tag_enzymes     = TAG('enzymes')\n",
    "\n",
    "counts = {'drugs':0,'interactions':0,'targets':0,'pathways':0,'enzymes':0}\n",
    "ctx = etree.iterparse('drugbank_data.xml', events=('end',), tag=tag_drug)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'drugs': 500, 'interactions': 398487, 'targets': 2571, 'pathways': 55896, 'enzymes': 1788}\n",
      "{'drugs': 1000, 'interactions': 884806, 'targets': 4460, 'pathways': 56276, 'enzymes': 4160}\n",
      "{'drugs': 1500, 'interactions': 1273100, 'targets': 6126, 'pathways': 57288, 'enzymes': 5527}\n",
      "{'drugs': 2000, 'interactions': 1321091, 'targets': 7333, 'pathways': 57988, 'enzymes': 5658}\n",
      "{'drugs': 2500, 'interactions': 1330772, 'targets': 8280, 'pathways': 129493, 'enzymes': 5682}\n",
      "{'drugs': 3000, 'interactions': 1337422, 'targets': 9202, 'pathways': 129928, 'enzymes': 5716}\n",
      "{'drugs': 3500, 'interactions': 1347582, 'targets': 10209, 'pathways': 130177, 'enzymes': 5731}\n",
      "{'drugs': 4000, 'interactions': 1353205, 'targets': 11221, 'pathways': 158666, 'enzymes': 5772}\n",
      "{'drugs': 4500, 'interactions': 1374009, 'targets': 12235, 'pathways': 205009, 'enzymes': 5887}\n",
      "{'drugs': 5000, 'interactions': 1475518, 'targets': 12990, 'pathways': 205017, 'enzymes': 6160}\n",
      "{'drugs': 5500, 'interactions': 1516509, 'targets': 13552, 'pathways': 205022, 'enzymes': 6302}\n",
      "{'drugs': 6000, 'interactions': 1675313, 'targets': 14379, 'pathways': 205043, 'enzymes': 6833}\n",
      "{'drugs': 6500, 'interactions': 1687694, 'targets': 14999, 'pathways': 205044, 'enzymes': 6863}\n",
      "{'drugs': 7000, 'interactions': 1692553, 'targets': 15748, 'pathways': 205088, 'enzymes': 6867}\n",
      "{'drugs': 7500, 'interactions': 1696827, 'targets': 16559, 'pathways': 205103, 'enzymes': 6872}\n",
      "{'drugs': 8000, 'interactions': 1738579, 'targets': 17426, 'pathways': 205255, 'enzymes': 7020}\n",
      "{'drugs': 8500, 'interactions': 2042253, 'targets': 18352, 'pathways': 205258, 'enzymes': 7756}\n",
      "{'drugs': 9000, 'interactions': 2063662, 'targets': 18408, 'pathways': 205265, 'enzymes': 7789}\n",
      "{'drugs': 9500, 'interactions': 2095165, 'targets': 18597, 'pathways': 205267, 'enzymes': 7861}\n",
      "{'drugs': 10000, 'interactions': 2214716, 'targets': 19333, 'pathways': 205272, 'enzymes': 8258}\n",
      "{'drugs': 10500, 'interactions': 2312679, 'targets': 20221, 'pathways': 205272, 'enzymes': 8587}\n",
      "{'drugs': 11000, 'interactions': 2385398, 'targets': 20742, 'pathways': 205275, 'enzymes': 8750}\n",
      "{'drugs': 11500, 'interactions': 2509443, 'targets': 21027, 'pathways': 205286, 'enzymes': 8820}\n",
      "{'drugs': 12000, 'interactions': 2667124, 'targets': 21225, 'pathways': 205292, 'enzymes': 8985}\n",
      "{'drugs': 12500, 'interactions': 2729492, 'targets': 21595, 'pathways': 205292, 'enzymes': 9193}\n",
      "{'drugs': 13000, 'interactions': 2801752, 'targets': 22324, 'pathways': 205292, 'enzymes': 9426}\n",
      "{'drugs': 13500, 'interactions': 2841339, 'targets': 22625, 'pathways': 205292, 'enzymes': 9566}\n",
      "{'drugs': 14000, 'interactions': 2868929, 'targets': 22812, 'pathways': 205292, 'enzymes': 9607}\n",
      "{'drugs': 14500, 'interactions': 2884350, 'targets': 23068, 'pathways': 205292, 'enzymes': 9694}\n",
      "{'drugs': 15000, 'interactions': 2894778, 'targets': 23237, 'pathways': 205292, 'enzymes': 9739}\n",
      "{'drugs': 15500, 'interactions': 2898141, 'targets': 23391, 'pathways': 205292, 'enzymes': 9768}\n",
      "{'drugs': 16000, 'interactions': 2901808, 'targets': 23449, 'pathways': 205292, 'enzymes': 9773}\n",
      "{'drugs': 16500, 'interactions': 2903708, 'targets': 23523, 'pathways': 205292, 'enzymes': 9801}\n",
      "{'drugs': 17000, 'interactions': 2908473, 'targets': 23619, 'pathways': 205292, 'enzymes': 9826}\n",
      "{'drugs': 17500, 'interactions': 2909383, 'targets': 23721, 'pathways': 205292, 'enzymes': 9845}\n",
      "{'drugs': 18000, 'interactions': 2909383, 'targets': 23858, 'pathways': 205292, 'enzymes': 9845}\n",
      "{'drugs': 18500, 'interactions': 2909383, 'targets': 23960, 'pathways': 205292, 'enzymes': 9845}\n",
      "{'drugs': 19000, 'interactions': 2909383, 'targets': 24089, 'pathways': 205292, 'enzymes': 9845}\n",
      "{'drugs': 19500, 'interactions': 2909383, 'targets': 24189, 'pathways': 205292, 'enzymes': 9845}\n",
      "FINAL: {'drugs': 19842, 'interactions': 2911156, 'targets': 24244, 'pathways': 205292, 'enzymes': 9848}\n"
     ]
    }
   ],
   "source": [
    "for _, el in ctx:\n",
    "    parent = el.getparent()\n",
    "    if parent is not None and parent.tag != tag_drugbank:\n",
    "        el.clear()\n",
    "        continue\n",
    "\n",
    "    counts['drugs']        += 1\n",
    "    counts['interactions'] += len(el.findall(f'.//{tag_interaction}'))\n",
    "    counts['targets']      += len(el.findall(f'.//{tag_targets}/{tag_target}'))\n",
    "    counts['pathways']     += len(el.findall(f'.//{tag_pathways}/{tag_pathway}'))\n",
    "    counts['enzymes']      += len(el.findall(f'.//{tag_enzymes}/{tag_enzyme}'))\n",
    "\n",
    "    el.clear()\n",
    "    while el.getprevious() is not None:\n",
    "        del el.getparent()[0]\n",
    "\n",
    "    if counts['drugs'] % 500 == 0:\n",
    "        print(counts)\n",
    "\n",
    "print('FINAL:', counts)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Testing connection with neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "URI:      neo4j+s://376f542a.databases.neo4j.io\n",
      "User:     376f542a\n",
      "Database: 376f542a\n",
      "\n",
      " Connection successful!\n"
     ]
    }
   ],
   "source": [
    "from dotenv import load_dotenv\n",
    "from neo4j import GraphDatabase\n",
    "import os\n",
    "\n",
    "load_dotenv()\n",
    "\n",
    "URI      = os.getenv(\"NEO4J_URI\")\n",
    "USER     = os.getenv(\"NEO4J_USERNAME\")\n",
    "PASSWORD = os.getenv(\"NEO4J_PASSWORD\")\n",
    "DATABASE = os.getenv(\"NEO4J_DATABASE\", \"neo4j\")\n",
    "\n",
    "print(f\"URI:      {URI}\")\n",
    "print(f\"User:     {USER}\")\n",
    "print(f\"Database: {DATABASE}\")\n",
    "\n",
    "try:\n",
    "    driver = GraphDatabase.driver(URI, auth=(USER, PASSWORD))\n",
    "    driver.verify_connectivity()\n",
    "    print(\"\\n Connection successful!\")\n",
    "except Exception as e:\n",
    "    print(f\"\\n Connection failed: {e}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Database is empty — ready for ingestion.\n"
     ]
    }
   ],
   "source": [
    "with driver.session(database=DATABASE) as session:\n",
    "    result = session.run(\"\"\"\n",
    "        MATCH (n)\n",
    "        RETURN labels(n)[0] AS label, count(n) AS count\n",
    "        ORDER BY count DESC\n",
    "    \"\"\")\n",
    "    rows = result.data()\n",
    "\n",
    "if rows:\n",
    "    print(\"Existing nodes found:\")\n",
    "    for row in rows:\n",
    "        print(f\"  {row['label']}: {row['count']}\")\n",
    "else:\n",
    "    print(\"Database is empty — ready for ingestion.\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Exploring data post ingestion\n",
    "### counts overview"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "  Pathway                48,622 nodes\n",
      "  Drug                    4,795 nodes\n",
      "  ProteinTarget           3,272 nodes\n"
     ]
    }
   ],
   "source": [
    "with driver.session(database=DATABASE) as s:\n",
    "    result = s.run(\"\"\"\n",
    "        MATCH (n)\n",
    "        RETURN labels(n)[0] AS label, count(n) AS count\n",
    "        ORDER BY count DESC\n",
    "    \"\"\")\n",
    "    for row in result:\n",
    "        print(f\"  {row['label']:<20} {row['count']:>8,} nodes\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "  TARGETS                      2,012 edges\n",
      "  METABOLIZED_BY               1,721 edges\n",
      "  PART_OF                        653 edges\n",
      "  INTERACTS_WITH                  12 edges\n"
     ]
    }
   ],
   "source": [
    "with driver.session(database=DATABASE) as s:\n",
    "    result = s.run(\"\"\"\n",
    "        MATCH ()-[r]->()\n",
    "        RETURN type(r) AS relationship, count(r) AS count\n",
    "        ORDER BY count DESC\n",
    "    \"\"\")\n",
    "    for row in result:\n",
    "        print(f\"  {row['relationship']:<25} {row['count']:>8,} edges\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Severity breakdown of interactions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "  Major              12\n"
     ]
    }
   ],
   "source": [
    "with driver.session(database=DATABASE) as s:\n",
    "    result = s.run(\"\"\"\n",
    "        MATCH ()-[r:INTERACTS_WITH]->()\n",
    "        RETURN r.severity AS severity, count(r) AS count\n",
    "        ORDER BY count DESC\n",
    "    \"\"\")\n",
    "    for row in result:\n",
    "        print(f\"  {row['severity']:<12} {row['count']:>8,}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Most connected drugs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "  Valproate bismuth                       6 interactions\n",
      "  Lasmiditan                              4 interactions\n",
      "  Dofetilide                              1 interactions\n",
      "  Hydroxyamphetamine                      1 interactions\n",
      "  Amitriptylinoxide                       1 interactions\n",
      "  Iofetamine I-123                        1 interactions\n",
      "  Normethadone                            1 interactions\n",
      "  Opium                                   1 interactions\n",
      "  Piritramide                             1 interactions\n",
      "  Torasemide                              1 interactions\n",
      "  Citalopram                              1 interactions\n",
      "  Dibenzepin                              1 interactions\n",
      "  Quinupramine                            1 interactions\n",
      "  Methoxyphenamine                        1 interactions\n",
      "  Fluconazole                             1 interactions\n"
     ]
    }
   ],
   "source": [
    "with driver.session(database=DATABASE) as s:\n",
    "    result = s.run(\"\"\"\n",
    "        MATCH (d:Drug)-[r:INTERACTS_WITH]-()\n",
    "        RETURN d.name AS drug, count(r) AS interactions\n",
    "        ORDER BY interactions DESC\n",
    "        LIMIT 15\n",
    "    \"\"\")\n",
    "    for row in result:\n",
    "        print(f\"  {row['drug']:<35} {row['interactions']:>5} interactions\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Most targetted proteins"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "  HRH1         Histamine H1 receptor                    targeted by 26 drugs\n",
      "  CHRM1        Muscarinic acetylcholine receptor M1     targeted by 24 drugs\n",
      "  CHRM3        Muscarinic acetylcholine receptor M3     targeted by 23 drugs\n",
      "  DRD2         D(2) dopamine receptor                   targeted by 21 drugs\n",
      "  ESR1         Estrogen receptor                        targeted by 20 drugs\n",
      "  CHRM2        Muscarinic acetylcholine receptor M2     targeted by 20 drugs\n",
      "               DNA                                      targeted by 18 drugs\n",
      "  PTGS2        Prostaglandin G/H synthase 2             targeted by 17 drugs\n",
      "  CHRM4        Muscarinic acetylcholine receptor M4     targeted by 17 drugs\n",
      "  AR           Androgen receptor                        targeted by 16 drugs\n",
      "  HTR2A        5-hydroxytryptamine receptor 2A          targeted by 16 drugs\n",
      "  NR1I2        Nuclear receptor subfamily 1 group I member 2 targeted by 16 drugs\n",
      "  CHRM5        Muscarinic acetylcholine receptor M5     targeted by 16 drugs\n",
      "  PTGS1        Prostaglandin G/H synthase 1             targeted by 15 drugs\n",
      "  DRD1         D(1A) dopamine receptor                  targeted by 14 drugs\n"
     ]
    }
   ],
   "source": [
    "with driver.session(database=DATABASE) as s:\n",
    "    result = s.run(\"\"\"\n",
    "        MATCH (d:Drug)-[:TARGETS]->(t:ProteinTarget)\n",
    "        RETURN t.name AS protein, t.gene AS gene, count(d) AS drug_count\n",
    "        ORDER BY drug_count DESC\n",
    "        LIMIT 15\n",
    "    \"\"\")\n",
    "    for row in result:\n",
    "        print(f\"  {row['gene']:<12} {row['protein']:<40} targeted by {row['drug_count']} drugs\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
